In [2]:
import seaborn as sns 
import pandas as pd 
from scipy.stats import f_oneway

In [4]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
df = df[["age","pclass"]].dropna()

In [10]:
df['pclass'].unique()

array([3, 1, 2])

In [11]:
#is there is any significiant relation between passenger class and ages

In [12]:
class_1 = df[df['pclass'] ==1]['age']
class_2 = df[df['pclass'] ==2]['age']
class_3 = df[df['pclass'] ==3]['age']

class_1

1      38.0
3      35.0
6      54.0
11     58.0
23     28.0
       ...
871    47.0
872    33.0
879    56.0
887    19.0
889    26.0
Name: age, Length: 186, dtype: float64

In [13]:
f_stats , p_value = f_oneway(class_1,class_2,class_3)
f_stats

np.float64(57.443484340676214)

In [14]:
p_value

np.float64(7.487984171959904e-24)

In [15]:
alpha = 0.05
if p_value < alpha:
    print("Reject the null hypothesis and there is a significant difference in atleast one passanger class")
else:
    print("Accept the null hypothesis and there is no a significant difference in atleast one passanger class")

Reject the null hypothesis and there is a significant difference in atleast one passanger class